# ExternalEvent Properties

---
The ExternalEvent type exposes the following members.
| Name| Description
---|---|---
| IsPending|  Checking whether an event has been raised but not yet executed.
Top
#### Reference
ExternalEvent Class
Autodesk.Revit.UI Namespace